{
  "project-title-front": "Algunos Proyectos de Front End",
  "project-title-back": "Algunos Proyectos de Back End",
  "project-1front-title": "Corona Virus Tracker",
  "project-1front-paragraph-1": "Este proyecto se construyo con el propósito de aprender sobre paginación, en este caso utilizando ",
  "project-1front-paragraph-2": " la cual es una librería muy liviana y una muy buena alternativa a ",
  "project-1front-paragraph-3": ". Uno de mis mayores problemas fue la ",
  "project-1accent-1": "entrada de datos",
  "project-1front-paragraph-4": ", en un comienzo encontré una API llamada ",
  "project-1front-paragraph-5": " la que tenía una documentación aceptable, pero le faltaba información acerca de las vacunaciones. Por lo que teniendo en cuenta esto, investigué sobre la entrada de datos de la herramienta de seguimiento de Covid de Google y encontré a ",
  "project-1front-paragraph-6": ", en este caso tenía toda la información que necesitaba (y mucho más), pero el problema es que los datos estaban todos juntos en formato raw, por lo que tuve que recuperar esta información ",
  "project-1accent-2": "cuidadosamente",
  "project-1front-paragraph-7": " para no arruinar el ",
  "project-1accent-3": "rendimiento",
  "project-1front-end": ". Visitá el ",
  "project-site": "sitio",
  "project-1front-end-1": " o mirá el código ",
  "project-here": "acá",
  "project-end-msg": ". Mirá el código ",
  "project-2front-paragraph-1": "Bueno, esta es la prueba de que ",
  "project-2accent-1": "no se necesitan construir cosas muy grandes ni complejas para aprender las bases de las tecnologías",
  "project-2front-paragraph-2": ", con esta primera iteración de la lista de quehaceres pude aprender las bases de React, luego de un tiempo lo retomé y decidí rehacerlo en ",
  "project-2front-paragraph-3": " y agregar ",
  "project-2front-paragraph-4": " para mejorar los estilos, nuevamente con el propósito de aprender. Terminé renegando un poco al principio, por toda la complejidad que agrega el tipado y mi rendimiento al programar disminuyó bastante. Luego ya más avanzado en el proyecto, pude ver lo mucho que valió la pena implementarlo en TypeScript, al final mi experiencia al desarrollar mejoró mucho debido a ",
  "project-2accent-2": "todos los beneficios y comodidades que provee el tipado",
  "project-1back-paragraph-1": "Esta es una REST API para almacenar archivos localmente. Esto lo desarrollé con la intención de practicar y aprender ",
  "project-1back-paragraph-2": " y utilice tecnologías como ",
  "project-1back-paragraph-3": " y ",
  "project-2back-paragraph-1": "Estas APIs, que sirven para realizar transferencias de dinero entre usuarios, las desarrolle como práctica de un taller de la UNSL junto con ",
  "project-2back-paragraph-2": ". Con esto aprendí las bases de REST y Microservicios, para esto utilicé ",
  "project-2back-paragraph-3": " y una librería de Google llamada "
}