{
  "project-title-front": "Some Front End Projects",
  "project-title-back": "Some Back End Projects",
  "project-1front-title": "Corona Virus Tracker",
  "project-1front-paragraph-1": "This project was built to learn about pagination, in this case with a very lightweight library named ",
  "project-1front-paragraph-2": " which is a very good alternative to ",
  "project-1front-paragraph-3": ". One of my main problems was the ",
  "project-1accent-1": "data input",
  "project-1front-paragraph-4": ", in a first approach I found an API called ",
  "project-1front-paragraph-5": " which had an acceptable documentation, but it lacked information about the vaccinations. So with this in mind, I searched the data input of the Google covid information tool and I found ",
  "project-1front-paragraph-6": ", in this case I had all the information that I needed (and much much more), but the problem was that this data was all together in raw format, so I had to fetch this data ",
  "project-1accent-2": "carefully",
  "project-1front-paragraph-7": " to not ruin the app ",
  "project-1accent-3": "performance",
  "project-1front-end": ". Visit the ",
  "project-site": "site",
  "project-1front-end-1": " or just view the code ",
  "project-here": "here",
  "project-2front-paragraph-1": "Well, this project is the prove that you ",
  "project-2accent-1": "don't need to build huge and complex stuff to learn the basics of technologies",
  "project-2front-paragraph-2": ", with this todo list I was able to learn the basics of React in a very first iteration of it, then I took it back and decided to re do it in ",
  "project-2front-paragraph-3": " and add ",
  "project-2front-paragraph-4": " for better styling, again for learning purposes. I ended up struggling a bit at the beggining, because all of the types stuff and my development performance decreased a lot, but when I was more into the project I realized how worth was to implement it in TypeScript. At the end my development experience improved a lot because of ",
  "project-2accent-2": "all the benefits and how convenient are the types"
}